; domain
(define (domain logisticaSE)

(:requirements :strips :typing )

(:types 
    persona loc caja contenido dron transportador num - objects

)

(:predicates 
    (loc-persona ?p - persona ?l - loc) ;localizacion de una persona herida
    (loc-caja ?c - caja ?l - loc) ;localizacion de una caja
    (caja-contenido ?c - caja ?cont - contenido) ;contenido de una caja
    (persona-tiene-contenido ?p - persona ?cont - contenido) ;la persona tiene ya un contenido
    (persona-tiene-caja ?p - persona ?c - caja) ;la persona tiene ya una caja
    (persona-necesita-contenido ?p - persona ?cont - contenido) ;necesita una persona contenido de una caja
    (loc-dron ?d - dron ?l - loc) ;localizacion del dron
    (siguiente ?n1 ?n2 - num ) ;siguiente del espacio del transportador
    (caja-cogida ?c - caja ?d - dron) ;caja cogida dispuesta a meterse en el transportador
    (dron-free ?d - dron) ;el dron esta libre para coger una caja
    (loc-transportador ?t - transportador ?l - loc)
    (caja-en-transportador ?c - caja ?t - transportador )
    (capacidad-actual ?t - transportador ?n - num)
    (caja-free ?c - caja)
)



(:action move-dron
    :parameters ( ?d - dron ?A - loc ?B - loc )
    :precondition (and
        (loc-dron ?d ?A)
        ;(dron-free ?d)
    )
    :effect (and 
        (loc-dron ?d ?B)
        ( not(loc-dron ?d ?A))
    )
)


(:action move-dron-transportador
    :parameters ( ?d - dron ?t - transportador ?A - loc ?B - loc )
    :precondition (and 
        (loc-dron ?d ?A)
        (dron-free ?d)
        (loc-transportador ?t ?A)
    )
    :effect (and 
        (loc-dron ?d ?B)
        ( not(loc-dron ?d ?A))
        (loc-transportador ?t ?B)
        ( not(loc-transportador ?t ?A))
    )
)

(:action poner-caja-transportador
    :parameters (
        ?c - caja ?t - transportador ?d - dron ?l - loc  ?nAnterior ?nPosterior - num 
    )
    :precondition (and 
        (siguiente ?nAnterior ?nPosterior)
        (caja-cogida ?c ?d)
        (loc-dron ?d ?l)
        (loc-transportador ?t ?l)
        (capacidad-actual ?t ?nAnterior)
    )
    :effect (and 
        (not(capacidad-actual ?t ?nAnterior))
        (capacidad-actual ?t ?nPosterior)
        (not (caja-cogida ?c ?d))
        (caja-en-transportador ?c ?t )
        (dron-free ?d)
    )
)


(:action take-caja-transportador
    :parameters (
        ?c - caja ?t - transportador ?d - dron ?l - loc ?nAnterior ?nPosterior - num
    )
    :precondition (and 
        (dron-free ?d)
        (caja-en-transportador ?c ?t )
        (loc-dron ?d ?l)
        (loc-transportador ?t ?l)
        (siguiente ?nAnterior ?nPosterior )
        (capacidad-actual ?t ?nPosterior)
    )
    :effect (and 
        (caja-cogida ?c ?d)
        (not (dron-free ?d))
        (capacidad-actual ?t ?nAnterior)
        (not (capacidad-actual ?t ?nPosterior) )
        (not (caja-en-transportador ?c ?t ))
    )
)

(:action take-caja
    :parameters ( ?c - caja ?d - dron ?l - loc)
    :precondition (and
        (loc-caja ?c ?l)
        (loc-dron ?d ?l)
        (dron-free ?d)
        (caja-free ?c)
    )
    :effect (and 
        (not (loc-caja ?c ?l))
        (not (dron-free ?d))
        (caja-cogida ?c ?d)

    )
)

(:action drop-caja
    :parameters ( ?c - caja ?d - dron ?cont - contenido ?p - persona ?l - loc)
    :precondition (and 
        (persona-necesita-contenido ?p ?cont)
        (caja-contenido ?c ?cont)
        (loc-dron ?d ?l)
        (loc-persona ?p ?l)
        (caja-cogida ?c ?d)
    )
    :effect (and 
        (loc-caja ?c ?l)
        (not (caja-cogida ?c ?d))
        (dron-free ?d)
        (persona-tiene-caja ?p ?c)
        (persona-tiene-contenido ?p ?cont)
        (not (persona-necesita-contenido ?p ?cont))
        (not(caja-free ?c))
    )
)

)

; problem
(define (problem drone_problem_d1_r1_l6_p6_c6_g6_ct3)(:domain logisticaSE)
(:objects
	dron1 - dron
	transportador1 - transportador
	n0 	n1 	n2 	n3 	n4  - num 
	deposito - loc
	Loc1 - loc
	Loc2 - loc
	Loc3 - loc
	Loc4 - loc
	Loc5 - loc
	Loc6 - loc
	caja1 - caja
	caja2 - caja
	caja3 - caja
	caja4 - caja
	caja5 - caja
	caja6 - caja
	food - contenido
	medicine - contenido
	bebida - contenido
	persona0 - persona
	persona1 - persona
	persona2 - persona
	persona3 - persona
	persona4 - persona
	persona5 - persona
)
(:init
	(loc-dron dron1 deposito)
	(loc-transportador transportador1 deposito)
	(persona-necesita-contenido persona0 food)
	(loc-persona persona0 Loc6)
	(caja-contenido caja1 food)
	(loc-caja caja1 deposito)
	(persona-necesita-contenido persona1 food)
	(loc-persona persona1 Loc4)
	(caja-contenido caja2 food)
	(loc-caja caja2 deposito)
	(persona-necesita-contenido persona3 food)
	(loc-persona persona3 Loc5)
	(caja-contenido caja3 food)
	(loc-caja caja3 deposito)
	(persona-necesita-contenido persona4 medicine)
	(loc-persona persona4 Loc4)
	(caja-contenido caja4 medicine)
	(loc-caja caja4 deposito)
	(persona-necesita-contenido persona4 bebida)
	(loc-persona persona4 Loc4)
	(caja-contenido caja5 bebida)
	(loc-caja caja5 deposito)
	(persona-necesita-contenido persona5 food)
	(loc-persona persona5 Loc4)
	(caja-contenido caja6 food)
	(loc-caja caja6 deposito)
	(caja-free caja1)
	(caja-free caja2)
	(caja-free caja3)
	(caja-free caja4)
	(caja-free caja5)
	(caja-free caja6)
	(siguiente n0 n1) 
	(siguiente n1 n2) 
	(siguiente n2 n3) 
	(siguiente n3 n4) 
	(capacidad-actual transportador1 n0)
	(dron-free dron1)
)
(:goal (and

	(loc-dron dron1 deposito)
	(persona-tiene-contenido persona0 food)
	(persona-tiene-contenido persona1 food)
	(persona-tiene-contenido persona3 food)
	(persona-tiene-contenido persona4 medicine)
	(persona-tiene-contenido persona4 bebida)
	(persona-tiene-contenido persona5 food)
	))
)

; plan
1. (take-caja caja4 dron1 deposito)
   deleted: (loc-caja caja4 deposito) (dron-free dron1)
   added: (caja-cogida caja4 dron1)
   goals met: 1 of 7
2. (move-dron dron1 deposito loc4)
   deleted: (loc-dron dron1 deposito)
   added: (loc-dron dron1 loc4)
   goals met: 0 of 7
3. (drop-caja caja4 dron1 medicine persona4 loc4)
   deleted: (caja-cogida caja4 dron1) (persona-necesita-contenido persona4 medicine) (caja-free caja4)
   added: (loc-caja caja4 loc4) (dron-free dron1) (persona-tiene-caja persona4 caja4) (persona-tiene-contenido persona4 medicine)
   goals met: 1 of 7
4. (move-dron dron1 loc4 deposito)
   deleted: (loc-dron dron1 loc4)
   added: (loc-dron dron1 deposito)
   goals met: 2 of 7
5. (take-caja caja5 dron1 deposito)
   deleted: (loc-caja caja5 deposito) (dron-free dron1)
   added: (caja-cogida caja5 dron1)
   goals met: 2 of 7
6. (move-dron dron1 deposito loc4)
   deleted: (loc-dron dron1 deposito)
   added: (loc-dron dron1 loc4)
   goals met: 1 of 7
7. (drop-caja caja5 dron1 bebida persona4 loc4)
   deleted: (caja-cogida caja5 dron1) (persona-necesita-contenido persona4 bebida) (caja-free caja5)
   added: (loc-caja caja5 loc4) (dron-free dron1) (persona-tiene-caja persona4 caja5) (persona-tiene-contenido persona4 bebida)
   goals met: 2 of 7
8. (move-dron dron1 loc4 deposito)
   deleted: (loc-dron dron1 loc4)
   added: (loc-dron dron1 deposito)
   goals met: 3 of 7
9. (take-caja caja1 dron1 deposito)
   deleted: (loc-caja caja1 deposito) (dron-free dron1)
   added: (caja-cogida caja1 dron1)
   goals met: 3 of 7
10. (move-dron dron1 deposito loc5)
   deleted: (loc-dron dron1 deposito)
   added: (loc-dron dron1 loc5)
   goals met: 2 of 7
11. (drop-caja caja1 dron1 food persona3 loc5)
   deleted: (caja-cogida caja1 dron1) (persona-necesita-contenido persona3 food) (caja-free caja1)
   added: (loc-caja caja1 loc5) (dron-free dron1) (persona-tiene-caja persona3 caja1) (persona-tiene-contenido persona3 food)
   goals met: 3 of 7
12. (move-dron dron1 loc5 deposito)
   deleted: (loc-dron dron1 loc5)
   added: (loc-dron dron1 deposito)
   goals met: 4 of 7
13. (take-caja caja2 dron1 deposito)
   deleted: (loc-caja caja2 deposito) (dron-free dron1)
   added: (caja-cogida caja2 dron1)
   goals met: 4 of 7
14. (move-dron dron1 deposito loc6)
   deleted: (loc-dron dron1 deposito)
   added: (loc-dron dron1 loc6)
   goals met: 3 of 7
15. (drop-caja caja2 dron1 food persona0 loc6)
   deleted: (caja-cogida caja2 dron1) (persona-necesita-contenido persona0 food) (caja-free caja2)
   added: (loc-caja caja2 loc6) (dron-free dron1) (persona-tiene-caja persona0 caja2) (persona-tiene-contenido persona0 food)
   goals met: 4 of 7
16. (move-dron dron1 loc6 deposito)
   deleted: (loc-dron dron1 loc6)
   added: (loc-dron dron1 deposito)
   goals met: 5 of 7
17. (take-caja caja3 dron1 deposito)
   deleted: (loc-caja caja3 deposito) (dron-free dron1)
   added: (caja-cogida caja3 dron1)
   goals met: 5 of 7
18. (move-dron dron1 deposito loc4)
   deleted: (loc-dron dron1 deposito)
   added: (loc-dron dron1 loc4)
   goals met: 4 of 7
19. (drop-caja caja3 dron1 food persona1 loc4)
   deleted: (caja-cogida caja3 dron1) (persona-necesita-contenido persona1 food) (caja-free caja3)
   added: (loc-caja caja3 loc4) (dron-free dron1) (persona-tiene-caja persona1 caja3) (persona-tiene-contenido persona1 food)
   goals met: 5 of 7
20. (move-dron dron1 loc4 deposito)
   deleted: (loc-dron dron1 loc4)
   added: (loc-dron dron1 deposito)
   goals met: 6 of 7
21. (take-caja caja6 dron1 deposito)
   deleted: (loc-caja caja6 deposito) (dron-free dron1)
   added: (caja-cogida caja6 dron1)
   goals met: 6 of 7
22. (move-dron dron1 deposito loc4)
   deleted: (loc-dron dron1 deposito)
   added: (loc-dron dron1 loc4)
   goals met: 5 of 7
23. (drop-caja caja6 dron1 food persona5 loc4)
   deleted: (caja-cogida caja6 dron1) (persona-necesita-contenido persona5 food) (caja-free caja6)
   added: (loc-caja caja6 loc4) (dron-free dron1) (persona-tiene-caja persona5 caja6) (persona-tiene-contenido persona5 food)
   goals met: 6 of 7
24. (move-dron dron1 loc4 deposito)
   deleted: (loc-dron dron1 loc4)
   added: (loc-dron dron1 deposito)
   goals met: 7 of 7
